renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_cmt_rx/src/r_cmt_rx.c
                    switch (channel)
                    {
                        case 0:
                        {
                            /*CMT0.CMCNT count is stopped*/
                            CMT.CMSTR0.BIT.STR0 = 0;
                        break;
                        }
                        case 1:
                        {
                            /*CMT1.CMCNT count is stopped*/
                            CMT.CMSTR0.BIT.STR1 = 0;
                        break;
                        }
                        #if   CMT_RX_NUM_CHANNELS == 4
                        case 2:
                        {
                            /*CMT2.CMCNT count is stopped*/
                            CMT.CMSTR1.BIT.STR2 = 0;
                        break;
                        }
                        case 3:
                        {
                            /*CMT3.CMCNT count is stopped*/
                            CMT.CMSTR1.BIT.STR3 = 0;
                        break;
                        }
                        #endif

                        default:
                        {
                        break;
                        }
                    }
                }
            }
            else
            {
                ret = false;
            }
            break;
        }

        /* Both restart and resume do the same thing, except restart zeros the counter first */ 
        case CMT_RX_CMD_RESTART:
        case CMT_RX_CMD_RESUME:
        {
            if (channel < CMT_RX_NUM_CHANNELS)
            {
                /* Stop the timer once to prevent an interrupt from occurring */
                switch (channel)
                {
                    case 0:
                    {
                        /*CMT0.CMCNT count is stopped*/
                        CMT.CMSTR0.BIT.STR0 = 0;
                    break;
                    }
                    case 1:
                    {
                        /*CMT1.CMCNT count is stopped*/
                        CMT.CMSTR0.BIT.STR1 = 0;
                    break;
                    }
#if   CMT_RX_NUM_CHANNELS == 4
                    case 2:
                    {
                        /*CMT2.CMCNT count is stopped*/
                        CMT.CMSTR1.BIT.STR2 = 0;
                    break;
                    }
                    case 3:
                    {
                        /*CMT3.CMCNT count is stopped*/
                        CMT.CMSTR1.BIT.STR3 = 0;
                    break;
                    }
#endif
                    default:
                    {
                    break;
                    }
                }

                /* Valid channel input. Is this channel currently counting? */
                if (CMT_RX_MODE_DISABLED != g_cmt_modes[channel])
                {

                    if (CMT_RX_CMD_RESTART == command)
                    {
                      /* For restarting, clear counter. */
                      (*g_cmt_channels[channel]).CMCNT = 0;
                    }

                    switch (channel)
                    {
                        case 0:
                        {
                            /*CMT0.CMCNT count is started*/
                            CMT.CMSTR0.BIT.STR0 = 1;
                        break;
                        }
                        case 1:
                        {
                            /*CMT1.CMCNT count is started*/
                            CMT.CMSTR0.BIT.STR1 = 1;
                        break;
                        }
#if   CMT_RX_NUM_CHANNELS == 4
                        case 2:
                        {
                            /*CMT2.CMCNT count is started*/
                            CMT.CMSTR1.BIT.STR2 = 1;
                        break;
                        }
                        case 3:
                        {
                            /*CMT3.CMCNT count is started*/
                            CMT.CMSTR1.BIT.STR3 = 1;
                        break;
                        }
#endif
                        default:
                        {
                        break;
                        }
                    }
                }
            }
            else
            {
                ret = false;
            }
        break;
        }
        case CMT_RX_CMD_SET_PRIORITY:
        {
            /* Make sure that pdata is NOT NULL */
            if (NULL == pdata)
            {
                ret = false;
            }
            else
            {
                /* Get input priority value from pdata */
                priority = *(cmt_priority_t *)pdata;
            }

            /* Check if interrupt priority and channel are correct or not */
            if (true == ret)
            {
                if ((CMT_PRIORITY_0 > priority)
                 || (CMT_PRIORITY_MAX < priority)
                 || (CMT_RX_NUM_CHANNELS <= channel))
                {
                    ret = false;
                }
            }

            if (true == ret)
            {
                /* Acquire lock on input channel to check if it was created or not */
                if (true == R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_CMT0 + channel)))
                {
                    /* Channel is NOT created yet, release lock on channel */
                    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMT0 + channel));

                    /* Set return value to false */
                    ret = false;
                }
                else
                {
                    switch (channel)
                    {
                        case 0:
                        {
                            /* Set interrupt priority using ICU register. */
                            IPR(CMT0, CMI0) = priority;
                        break;
                        }

                        case 1:
                        {
                            /* Set interrupt priority using ICU register. */
                            IPR(CMT1, CMI1) = priority;
                        break;
                        }

#if CMT_RX_NUM_CHANNELS == 4
                        case 2:
                        {
                            /* Set interrupt priority using ICU register. */
                            IPR(CMT2, CMI2) = priority;
                        break;
                        }

                        case 3:
                        {
                            /* Set interrupt priority using ICU register. */
                            IPR(CMT3, CMI3) = priority;
                        break;
                        }

#endif
                        default:
                        {
                            /* Should never get here. */
                            nop();
                        break;
                        }
                    }
                }
            }
        }
        break;
        
        case CMT_RX_CMD_GET_PRIORITY:
        {
            /* Make sure that CMT channel is correct, pdata is NOT NULL */
            if ((CMT_RX_NUM_CHANNELS <= channel) || (NULL == pdata))
            {
                ret = false;
            }
            else
            {
                switch(channel)
                {
                    case 0:
                    {
                        /* Get priority of CMT channel 0 from IPR register */
                        priority = (cmt_priority_t)IPR(CMT0, CMI0);
                    break;
                    }

                    case 1:
                    {
                        /* Get priority of CMT channel 1 from IPR register */
                        priority = (cmt_priority_t)IPR(CMT1, CMI1);
                    break;
                    }

#if CMT_RX_NUM_CHANNELS == 4
                    case 2:
                    {
                        /* Get priority of CMT channel 2 from IPR register */
                        priority = (cmt_priority_t)IPR(CMT2, CMI2);
                    break;
                    }

                    case 3:
                    {
                        /* Get priority of CMT channel 3 from IPR register */
                        priority = (cmt_priority_t)IPR(CMT3, CMI3);
                    break;
                    }
                    
                    default:
                    {
                        /* Should never get here. */
                        ret = false;
                    break;
                    }
#endif
                }

                /* Update pdata value with priority for output */
                *(cmt_priority_t *)pdata = priority;
            }
        break;
        }

        default:
        {
            ret = false;
        break;
        }
    }

    return ret;
}
/***********************************************************************************************************************
* End of function R_CMT_Control
***********************************************************************************************************************/

