renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_cmt_rx/src/r_cmt_rx.c
/***********************************************************************************************************************
* Function Name: cmt_find_channel
* Description  : Attempt to find open CMT channel to use.
* Arguments    : channel - 
*                    Channel number if channel was found.
* Return Value : true -
*                    Channel was found and locked.
*                false -
*                    No channels available.
***********************************************************************************************************************/
static bool cmt_find_channel (uint32_t * channel)
{
    bool     channel_found = false;
    uint32_t i;

    /* Look for an available channel. */
    /* WAIT_LOOP */
    for (i = 0; i < CMT_RX_NUM_CHANNELS; i++)
    {
#if BSP_CFG_RTOS_USED == 0      /* Non-OS */
#elif BSP_CFG_RTOS_USED == 1    /* FreeRTOS */
        if (i == BSP_CFG_RTOS_SYSTEM_TIMER)
        {
            /* Found CMT channel is being used for RTOS. */
            continue;
        }
#elif BSP_CFG_RTOS_USED == 2    /* SEGGER embOS */
#elif BSP_CFG_RTOS_USED == 3    /* Micrium MicroC/OS */
#elif BSP_CFG_RTOS_USED == 4    /* Renesas RI600V4 & RI600PX */
#endif
        /* Look for an available channel. */
        if (true == R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_CMT0 + i)))
        {
            /* Channel found. */
            *channel = i;
            channel_found = true;
            
            break;            
        }
    }        

    return channel_found;
}
/* End of function cmt_find_channel */

/***********************************************************************************************************************
* Function Name: power_on
* Description  : Enables CMT channel.
* Arguments    : channel - 
*                    Channel number to enable.
* Return Value : none
***********************************************************************************************************************/
static void power_on (uint32_t channel)
{
#if CMT_REG_PROTECT == 1
    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
#endif

    /* Enable selected CMT Channel. Go ahead and make sure counter is stopped too. */
    switch (channel)
    {
        case 0:
            {
            /* Bring module out of stop state. */
            MSTP(CMT0) = 0;

            /* Stop counter. */
            CMT.CMSTR0.BIT.STR0 = 0;
            break;
            }
        case 1:
            {
            /* Bring module out of stop state. */
            MSTP(CMT1) = 0;

            /* Stop counter. */
            CMT.CMSTR0.BIT.STR1 = 0;        
            break;
            }
#if   CMT_RX_NUM_CHANNELS == 4
        case 2:
            {
            /* Bring module out of stop state. */
            MSTP(CMT2) = 0;

            /* Stop counter. */
            CMT.CMSTR1.BIT.STR2 = 0;        
            break;
            }
        case 3:
            {
            /* Bring module out of stop state. */
            MSTP(CMT3) = 0;

            /* Stop counter. */
            CMT.CMSTR1.BIT.STR3 = 0;       
            break;
            }
#endif
        default:
            {
            /* Should never get here. Valid channel number is checked above. */
            break;
            }
    }    

#if CMT_REG_PROTECT == 1

    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
#endif
}
/***********************************************************************************************************************
* End of function power_on
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name: power_off
* Description  : Disables CMT channel.
* Arguments    : channel - 
*                    Channel number to disable.
* Return Value : none
***********************************************************************************************************************/
static void power_off (uint32_t channel)
{
#if CMT_REG_PROTECT == 1

    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
#endif

    /* Enable selected CMT Channel. Go ahead and make sure counter is stopped too. Since each MSTP bit controls
       2 channels, make sure to only disable CMT unit when both channels are off. */
    switch (channel)
    {
        case 0:
            {
            /* Stop counter. */
            CMT.CMSTR0.BIT.STR0 = 0;

            /* Only turn off CMT unit if both channels are off. */
            if (CMT_RX_MODE_DISABLED == g_cmt_modes[1])
            {
                /* Put module in stop state. */
                MSTP(CMT0) = 1;
            }
            break;
            }
        case 1:
            {
            /* Stop counter. */
            CMT.CMSTR0.BIT.STR1 = 0;        

            /* Only turn off CMT unit if both channels are off. */
            if (CMT_RX_MODE_DISABLED == g_cmt_modes[0])
            {
                /* Put module in stop state. */
                MSTP(CMT1) = 1;
            }
            break;
            }
#if   CMT_RX_NUM_CHANNELS == 4
        case 2:
            {
            /* Stop counter. */
            CMT.CMSTR1.BIT.STR2 = 0;        

            /* Only turn off CMT unit if both channels are off. */
            if (CMT_RX_MODE_DISABLED == g_cmt_modes[3])
            {
                /* Put module in stop state. */
                MSTP(CMT2) = 1;
            }
            break;
            }
        case 3:
            {
            /* Stop counter. */
            CMT.CMSTR1.BIT.STR3 = 0;       

            /* Only turn off CMT unit if both channels are off. */
            if (CMT_RX_MODE_DISABLED == g_cmt_modes[2])
            {

                /* Put module in stop state. */
                MSTP(CMT3) = 1;
            }
            break;
            }
#endif
        default:
            {
            /* Should never get here. Valid channel number is checked above. */
            break;
            }
    }    

