renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_cmt_rx/src/r_cmt_rx.c
#if CMT_REG_PROTECT == 1
    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
#endif
}
/***********************************************************************************************************************
* End of function power_off
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name: cmt_counter_start
* Description  : Starts a CMT channel counting.
* Arguments    : channel - 
*                    Channel number to use.
* Return Value : none
***********************************************************************************************************************/
static void cmt_counter_start (uint32_t channel)
{
    /* Enable compare match interrupt. */
    (*g_cmt_channels[channel]).CMCR.BIT.CMIE = 1;

    /* Clear counter. */
    (*g_cmt_channels[channel]).CMCNT = 0;

    /* Start counter channel. */
    switch (channel)
    {
        case 0:
            {
            /* Setup ICU registers. */
            IR(CMT0, CMI0)  = 0;                /* Clear any previously pending interrupts */
            IPR(CMT0, CMI0) = CMT_RX_CFG_IPR;   /* Set interrupt priority */
            IEN(CMT0, CMI0) = 1;                /* Enable compare match interrupt */

            /* Start counter. */
            CMT.CMSTR0.BIT.STR0 = 1;
            break;
            }
        case 1:
            {
            /* Setup ICU registers. */
            IR(CMT1, CMI1)  = 0;                /* Clear any previously pending interrupts */
            IPR(CMT1, CMI1) = CMT_RX_CFG_IPR;   /* Set interrupt priority */
            IEN(CMT1, CMI1) = 1;                /* Enable compare match interrupt */

            /* Start counter. */
            CMT.CMSTR0.BIT.STR1 = 1;        
            break;
            }
#if   CMT_RX_NUM_CHANNELS == 4
        case 2:
            {
            /* Setup ICU registers. */
            IR(CMT2, CMI2)  = 0;                /* Clear any previously pending interrupts */
            IPR(CMT2, CMI2) = CMT_RX_CFG_IPR;   /* Set interrupt priority */
            IEN(CMT2, CMI2) = 1;                /* Enable compare match interrupt */

            /* Start counter. */
            CMT.CMSTR1.BIT.STR2 = 1;        
            break;
            }
        case 3:
            {
            /* Setup ICU registers. */
            IR(CMT3, CMI3)  = 0;                /* Clear any previously pending interrupts */
            IPR(CMT3, CMI3) = CMT_RX_CFG_IPR;   /* Set interrupt priority */
            IEN(CMT3, CMI3) = 1;                /* Enable compare match interrupt */

            /* Start counter. */
            CMT.CMSTR1.BIT.STR3 = 1;       
            break;
            }
#endif
        default:
        {
            /* Should never get here. Valid channel number is checked above. */
        break;
        }
    }    
}
/***********************************************************************************************************************
* End of function cmt_counter_start
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name: cmt_counter_start_priority
* Description  : Starts a CMT channel counting with interrupt priority.
* Arguments    : channel -
*                    Channel number to use.
*                priority -
*                    Which interrupt priority is used to assign.
* Return Value : none
***********************************************************************************************************************/
static void cmt_counter_start_priority (uint32_t channel, cmt_priority_t priority)
{
    /* Enable compare match interrupt. */
    (*g_cmt_channels[channel]).CMCR.BIT.CMIE = 1;

    /* Clear counter. */
    (*g_cmt_channels[channel]).CMCNT = 0;

    /* Start counter channel. */
    switch (channel)
    {
        case 0:
            {
            /* Setup ICU registers. */
            IR(CMT0, CMI0)  = 0;                /* Clear any previously pending interrupts */
            IPR(CMT0, CMI0) = priority;         /* Set interrupt priority */
            IEN(CMT0, CMI0) = 1;                /* Enable compare match interrupt */

            /* Start counter. */
            CMT.CMSTR0.BIT.STR0 = 1;
            break;
            }
        case 1:
            {
            /* Setup ICU registers. */
            IR(CMT1, CMI1)  = 0;                /* Clear any previously pending interrupts */
            IPR(CMT1, CMI1) = priority;         /* Set interrupt priority */
            IEN(CMT1, CMI1) = 1;                /* Enable compare match interrupt */

            /* Start counter. */
            CMT.CMSTR0.BIT.STR1 = 1;
            break;
            }
#if   CMT_RX_NUM_CHANNELS == 4
        case 2:
            {
            /* Setup ICU registers. */
            IR(CMT2, CMI2)  = 0;                /* Clear any previously pending interrupts */
            IPR(CMT2, CMI2) = priority;         /* Set interrupt priority */
            IEN(CMT2, CMI2) = 1;                /* Enable compare match interrupt */

            /* Start counter. */
            CMT.CMSTR1.BIT.STR2 = 1;
            break;
            }
        case 3:
            {
            /* Setup ICU registers. */
            IR(CMT3, CMI3)  = 0;                /* Clear any previously pending interrupts */
            IPR(CMT3, CMI3) = priority;         /* Set interrupt priority */
            IEN(CMT3, CMI3) = 1;                /* Enable compare match interrupt */

            /* Start counter. */
            CMT.CMSTR1.BIT.STR3 = 1;
            break;
            }
#endif
        default:
        {
            /* Should never get here. Valid channel number is checked above. */
        break;
        }
    }
}
/***********************************************************************************************************************
* End of function cmt_counter_start_priority
***********************************************************************************************************************/

