renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_cmt_rx/src/r_cmt_rx.c
/***********************************************************************************************************************
* Function Name: cmt_counter_stop
* Description  : Stops a CMT channel counting.
* Arguments    : channel - 
*                    Channel number to use.
* Return Value : none
***********************************************************************************************************************/
static void cmt_counter_stop (uint32_t channel)
{
    /* Stop counter channel. */
    switch (channel)
    {
        case 0:
            {
            /* Stop counter. */
            CMT.CMSTR0.BIT.STR0 = 0;

            /* Set ICU registers. */
            IEN(CMT0, CMI0) = 0;            /* Disable compare match interrupt */
            IPR(CMT0, CMI0) = 0;            /* Set interrupt priority */
            IR(CMT0, CMI0)  = 0;            /* Clear any previously pending interrupts */
            break;
            }
        case 1:
            {
            /* Stop counter. */
            CMT.CMSTR0.BIT.STR1 = 0;        

            /* Set ICU registers. */
            IEN(CMT1, CMI1) = 0;            /* Disable compare match interrupt */
            IPR(CMT1, CMI1) = 0;            /* Set interrupt priority */
            IR(CMT1, CMI1)  = 0;            /* Clear any previously pending interrupts */
            break;
            }
#if   CMT_RX_NUM_CHANNELS == 4
        case 2:
            {
            /* Stop counter. */
            CMT.CMSTR1.BIT.STR2 = 0;        

            /* Set ICU registers. */
            IEN(CMT2, CMI2) = 0;            /* Disable compare match interrupt */
            IPR(CMT2, CMI2) = 0;            /* Set interrupt priority */
            IR(CMT2, CMI2)  = 0;            /* Clear any previously pending interrupts */
            break;
            }
        case 3:
            {
            /* Stop counter. */
            CMT.CMSTR1.BIT.STR3 = 0;       

            /* Set ICU registers. */
            IEN(CMT3, CMI3) = 0;            /* Disable compare match interrupt */
            IPR(CMT3, CMI3) = 0;            /* Set interrupt priority */
            IR(CMT3, CMI3)  = 0;            /* Clear any previously pending interrupts */
            break;
            }
#endif
        default:
            {
            /* Should never get here. Valid channel number is checked above. */
            break;
            }
    }    
}
/***********************************************************************************************************************
* End of function cmt_counter_stop
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: cmt_setup_channel
* Description  : Sets dividers and counter so compare match occurs at input frequency.
* Arguments    : channel - 
*                    Channel number to use.
*                frequency_hz -
*                    Frequency at which to set CMT channel
* Return Value : true -
*                    Channel setup completed.
*                false -
*                    Channel setup failed.
***********************************************************************************************************************/
static bool cmt_setup_channel (uint32_t channel, uint32_t frequency_hz)
{
    uint32_t i;
    bool     ret = false;

    /* Requested frequency must not be higher than PCLK. */
    if (((uint32_t)CMT_PCLK_HZ / 8) >= frequency_hz)
    {
        /* Choose clock. This is done by looking through the available dividers to see if we can match the frequency
           input by the user. */
        /* WAIT_LOOP */   
        for (i = 0; i < ((sizeof(g_cmt_clock_dividers))/(sizeof(g_cmt_clock_dividers[0]))); i++)
        {
            /* Determine minimum frequency this divider can hit. For example, if a PCLK/8 is used and PCLK is 48MHz, then
               the minimum frequency we can support is around 91.5Hz. This obtained by doing the following calculation:
               (PCLK / divider) / max_counter_value
               Example:
               (48,000,000 / 8) / 65,536 = 91.5 */
            if (frequency_hz > (((uint32_t)CMT_PCLK_HZ / g_cmt_clock_dividers[i]) / (uint32_t)CMT_RX_MAX_TIMER_TICKS))
            {
                /* Enable peripheral channel. */
                power_on(channel);

                /* We can use this divider. Figure out counter ticks needed for this frequency. */
                (*g_cmt_channels[channel]).CMCOR = (uint16_t)((((uint32_t)CMT_PCLK_HZ /g_cmt_clock_dividers[i])/frequency_hz) -1 );


                /* Set clock divider to be used. */
                (*g_cmt_channels[channel]).CMCR.BIT.CKS = i;

                /* Save that we did find a valid divider. */
                ret = true;

                /* No need to check other dividers. */
                break;
            }
        }
    }

    return ret;
}
/***********************************************************************************************************************
* End of function cmt_setup_channel
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name: R_CMT_GetVersion
* Description  : Returns the current version of this module. The version number is encoded where the top 2 bytes are the
*                major version number and the bottom 2 bytes are the minor version number. For example, Version 4.25 
*                would be returned as 0x00040019.
* Arguments    : none
* Return Value : Version of this module.
***********************************************************************************************************************/
#pragma inline(R_CMT_GetVersion)
uint32_t R_CMT_GetVersion (void)
{
    /* These version macros are defined in r_cmt_rx_if.h. */
    return ((((uint32_t)CMT_RX_VERSION_MAJOR) << 16) | (uint32_t)CMT_RX_VERSION_MINOR);
}
/* End of function R_CMT_GetVersion */

